       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJECT03_P3_SUB.
       DATA DIVISION.
       LINKAGE SECTION.
           01 AVERAGE-GRADE PIC 9(3).
           01 COURSE-AVERAGE-1 PIC 9(3).
           01 COURSE-AVERAGE-2 PIC 9(3).
           01 COURSE-AVERAGE-3 PIC 9(3).
           01 COURSE-AVERAGE-4 PIC 9(3).
           01 COURSE-AVERAGE-5 PIC 9(3).
       PROCEDURE DIVISION USING
               AVERAGE-GRADE, COURSE-AVERAGE-1,
               COURSE-AVERAGE-2, COURSE-AVERAGE-3
               COURSE-AVERAGE-4, COURSE-AVERAGE-5.

           COMPUTE AVERAGE-GRADE ROUNDED =
           (COURSE-AVERAGE-1
           + COURSE-AVERAGE-2
           + COURSE-AVERAGE-3
           + COURSE-AVERAGE-4
           + COURSE-AVERAGE-5)
           / 5.

       EXIT PROGRAM.
