      ******************************************************************
      * Authors: MOSTAPHA A
      * Purpose: CONVERTS A TEXT FILE TO AN INDEXED SEQUENTIAL FILE
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJECT03_P1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
      *        EXTERNAL FILE WITH STUDENT RECORDS
               SELECT STUDENT-FILE-IN
                   ASSIGN TO "../STUFILE3.TXT"
                       ORGANIZATION IS LINE SEQUENTIAL.

      *        EXTERNAL FILE TO WRITE STUDENT REPORTS TO
               SELECT STUDENT-FILE-OUT
                   ASSIGN TO "../INDEXED-STUFILE3.IND"
                       ORGANIZATION IS INDEXED
                           ACCESS MODE IS RANDOM
                               RECORD KEY IS STUDENT-NUMBER-OUT
                         ALTERNATE KEY STUDENT-NAME-OUT WITH DUPLICATES
                           FILE STATUS IS STATUS-FILED.

       DATA DIVISION.
       FILE SECTION.
      * STUDENT RECORD READ FROM EXTERNAL FILE
       FD STUDENT-FILE-IN.
       01 STUDENT-RECORD-IN.
           05 STUDENT-NUMBER-IN PIC 9(6).
           05 TUITION-OWED-IN PIC 9(4)V99.
           05 STUDENT-NAME-IN PIC X(40).
           05 PROGRAM-OF-STUDY-IN PIC X(5).
           05 COURSE-CODE-1-IN PIC X(7).
           05 COURSE-AVERAGE-1-IN PIC 9(3).
           05 COURSE-CODE-2-IN PIC X(7).
           05 COURSE-AVERAGE-2-IN PIC 9(3).
           05 COURSE-CODE-3-IN PIC X(7).
           05 COURSE-AVERAGE-3-IN PIC 9(3).
           05 COURSE-CODE-4-IN PIC X(7).
           05 COURSE-AVERAGE-4-IN PIC 9(3).
           05 COURSE-CODE-5-IN PIC X(7).
           05 COURSE-AVERAGE-5-IN PIC 9(3).

      * STUDENT RECORD WRITTEN TO AN EXTERNAL FILE
       FD STUDENT-FILE-OUT.
       01 STUDENT-RECORD-OUT.
           05 STUDENT-NUMBER-OUT PIC 9(6).
           05 TUITION-OWED-OUT PIC 9(4)V99.
           05 STUDENT-NAME-OUT PIC X(40).
           05 PROGRAM-OF-STUDY-OUT PIC X(5).
           05 COURSE-CODE-1-OUT PIC X(7).
           05 COURSE-AVERAGE-1-OUT PIC 9(3).
           05 COURSE-CODE-2-OUT PIC X(7).
           05 COURSE-AVERAGE-2-OUT PIC 9(3).
           05 COURSE-CODE-3-OUT PIC X(7).
           05 COURSE-AVERAGE-3-OUT PIC 9(3).
           05 COURSE-CODE-4-OUT PIC X(7).
           05 COURSE-AVERAGE-4-OUT PIC 9(3).
           05 COURSE-CODE-5-OUT PIC X(7).
           05 COURSE-AVERAGE-5-OUT PIC 9(3).

       WORKING-STORAGE SECTION.
       01 CONTROL-FIELDS.
      *    END OF FILE FLAG
           05 EOF-FLAG PIC A.
      *    STORES STATUS OF WRITING TO INDEXED FILE
           01 STATUS-FILED PIC X(2).

       PROCEDURE DIVISION.
       100-CREATE-INDEXED-FILE.
           PERFORM 201-INITIALIZE
      *     LOOP UNTIL THE END OF FILE
           PERFORM 202-MOVE-RECORDS
               UNTIL EOF-FLAG EQUALS "Y".
           PERFORM 203-TERMINATE.
           STOP RUN.

      * OPEN THE FILES WE ARE READING AND WRITING
       201-INITIALIZE.
           PERFORM 301-OPEN-FILES.
           PERFORM 302-READ-RECORDS.

      * MOVES THE RECORDS
       202-MOVE-RECORDS.
           PERFORM 303-WRITE-RECORDS.
           PERFORM 302-READ-RECORDS.

      * CLOSES THE FILES
       203-TERMINATE.
           CLOSE STUDENT-FILE-IN
                 STUDENT-FILE-OUT.

      * OPENS THE FILES
       301-OPEN-FILES.
           OPEN INPUT STUDENT-FILE-IN.
           OPEN OUTPUT STUDENT-FILE-OUT.

      * READS A RECORD
       302-READ-RECORDS.
           READ STUDENT-FILE-IN AT END MOVE "Y" TO EOF-FLAG.

      * WRITES A RECORD
       303-WRITE-RECORDS.
           MOVE STUDENT-RECORD-IN TO STUDENT-RECORD-OUT.
           WRITE STUDENT-RECORD-OUT
           INVALID KEY
               DISPLAY "INVALID KEY FOR " STUDENT-NUMBER-OUT
               " STATUS FILED IS " STATUS-FILED
           NOT INVALID KEY
               DISPLAY "INDEXED STUDENT " STUDENT-NUMBER-OUT
           END-WRITE.

       END PROGRAM PROJECT03_P1.
